// TODO: № 1 на if...else ===============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.
//const a = 8;
// if (a === 10) {
//   console.log("Вірно");
// } else {
//   console.log("Невірно");
// }

//TODO: № 2 на тернарник =============================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно' через тернарник

//console.log(a === 10 ? "Вірно" : "Невірно");

//TODO: № 3 на if...else if ===============================================
// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).

// let min = 60;

// if (min >= 0 && min < 15) {
//     console.log("Перша чверть години");
// } else if (min >= 15 && min < 30) {
//     console.log("Друга чверть години");    
// } else if (min >= 30 && min < 45) {
//     console.log("Третя чверть години");    
// } else if (min >= 45 && min < 60) {
//     console.log("Четверта чверть години");
// } else {
//     console.log("Введене неправильне значення");
// }:)